# План тестирования

## Содержание
1. [Введение](#introduction)
2. [Объект тестирования](#items)
3. [Атрибуты качества](#quality)
5. [Аспекты тестирования](#features)
6. [Подходы к тестированию](#approach)
7. [Представление результатов](#pass)
8. [Выводы](#conclusion)

## 1 Введение <a name = "#introduction"></a>

Данный документ описывает план тестирования Телеграм-бота. Он предназначен для людей, выполняющих тестирование приложения, в частности тестировщиков. Цель тестирования - проверка соответствия между реальным поведением программы и её ожидаемым поведением на основе [требований](../SRS_ru.md).

## 2 Объект тестирования <a name = "#items"></a>

В качестве объектов тестирования можно выделить основные [функциональные требования](../SRS_ru.md). К основным модулям следует отнести:
* модуль отображения информации о погоде
* модуль отображения рассписания занятия
* модуль отображения информации о преподавателе

## 3 Атрибуты качетсва <a name = "#quality"></a>

1. Функциональность:
   1. Функциональная полнота: приложение должно выполнять все заявленные [функции](../SRS_ru.md);
   2. Функциональная корректность: приложение должно выполнять все заявленные функции корректно;
   3. Функциональная целесообразность: отсутствуют не заявленные функции, которые бы мешали приложению выполнить первоначально поставленные задачи;

## 4 Аспекты тестирования <a name = "#approach"></a>

В ходе тестирования планируется проверить реализацию основных функций приложения. Данное тестирования будет проводится человеком, не имевшим возможность наблюдать за этапами разработки и не знакомым с исходным кодом.

Аспекты, подвергаемые тестированию:
* отображение информации о погоде
* отображение информации о рассписании
* отображение информации о преподавателе

### отображение информации о погоде
Этот вариант использования необходимо протестировать на:
* Попытка открыть видеофайл;
* Попытка открыть аудиофайл;
* Попытка открыть не медиафайл;

### отображение информации о рассписании
Этот вариант использования необходимо протестировать на:
* Воспроизведение видеофайлов в форматах .mp4 и .avi;
* Воспроизведение видеофайлов в других форматах.

### отображение информации о преподавателе
Этот вариант использования необходимо протестировать на:
* Воспроизведение аудиофайлов в формате .mp3;
* Воспроизведение аудиофайлов в других форматах.

## 6 Подходы к тестированию <a name = "approach"></a>

Для тестирования телеграм-бота будет использован ручной подход.

## 7 Предоставление результатов <a name = "pass"></a>

Результаты тестирования представлены в документе ["Результаты тестирования"](./Testing_results.md).

## 8 Выводы <a name = "conclusion"></a>

Исходя из результатов тестирования можно сделать вывод о том, что телеграмм-бот практически полностью соответствует фунциональным требованиям. Также можно сделать вывод о том, что приложение полностью удовлетворяет нефункциональным требованиям. Функционал приложения является небольшим, но позволяющим отображать необходимую информацию студенту БГУИР.
